app/controllers/tweets_controller.rb

SELECT  "follows".* FROM "follows" ORDER BY "follows"."id" ASC LIMIT ? OFFSET ?  [["LIMIT", 1], ["OFFSET", 1]]
SELECT "tweets".* FROM "tweets" WHERE "tweets"."user_id" IN (?, ?, ?) ORDER BY created_at DESC  [["user_id", 2], ["user_id", 3], ["user_id", 4]]
---
  def index
    followers_ids = current_user.following.pluck(:id)
    if followers_ids.present?
      if params[:tweet][:order] == 'desc'
        @tweets = Tweet.where(user_id: followers_ids).order("created_at DESC")

INSERT INTO "tweets" ("message", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["message", "This is my latest tweet"], ["user_id", 1], ["created_at", "2020-02-22 08:47:21.744349"], ["updated_at", "2020-02-22 08:47:21.744349"]]
---
  def create
    if params[:tweet][:message].blank?
      render json: {error: 'Please proivde valid parameters'}
      return
    end
    tweet = current_user.tweets.create(message: params[:tweet][:message])